
MulDistID = "17966"; --plus 奧妮克希亞皮袋 17966 統計拾取次數

CEPGP_NeedMes = "需求的，請直接[私聊]我打\"1\"。"; --1
CEPGP_NeedGreedMes = "100%GP 需求的，請直接[私聊]我打\"1\"，10%GP 貪婪的，請直接[私聊]我打\"2\"。"; --2
CEPGP_GreedMes = "10%GP 貪婪的，請直接[私聊]我打\"2\"。"; --3

---["物品ID"] = {"物品說明", 1, 0 }---(Need=1,NeedGreed=2,Greed=3)(1=通告歷史分配數量)
CEPGP_ItemPR = {
---------------黑龍-----------------------
			["17966"] = {"沒拿過的請Roll點。Roll點最高的，請[私聊]我打\"1\"。", 0, 0 },	--奧妮克希亞皮袋
---------------MC------------------
			["18703"] = {"1CD，獵人不可貪婪", 1, 0 },	--遠古石葉
			["18646"] = {"1CD，牧師不可貪婪; 牧師必須有", 1, 0 },	--神聖之眼
			["18814"] = {"3CD，法師術士不可貪婪; 法師=術士", 1, 1 },	--火焰之王的項圈
			["17065"] = {"1CD，防戰不可貪婪; 防戰>狂戰", 1, 0 },	--穩固之力勳章
			["17102"] = {"3CD，獵人盜賊不可貪婪; 獵人>盜賊", 1, 0 },	--環霧披風
			["19147"] = {"3CD，法師術士不可貪婪; 法師=術士", 1, 1 },	--法術能量之戒
			["19140"] = {"3CD，全補師不可貪婪; 全補師平權", 1, 0 },		--灼燒指環
			["18879"] = {"1CD，防戰不可貪婪; 防戰>狂戰", 1, 0 },	--沉重的黑鐵戒指
			["18821"] = {"3CD，獵人盜賊狂戰不可貪婪; 獵人>盜賊=狂戰", 1, 1 },	--迅擊戒指
			["17063"] = {"3CD，盜賊戰士獵人不可貪婪; 盜賊=狂戰>防戰>獵人", 1, 1 },	--埃古雷亞指環
			["18820"] = {"3CD，法師術士不可貪婪; 法師=術士", 1, 1 },	--短暫能量護符
			["19145"] = {"1CD，法師術士不可貪婪; 法師=術士", 1, 0 },	--波動長袍
			["19136"] = {"1CD，法師術士不可貪婪; 法師=術士", 1, 0 },	--燃魔腰帶
			["19146"] = {"1CD，狂戰不可貪婪; 狂戰最優先", 1, 0 },	--穩固護腕
			["18810"] = {"1CD，補德不可貪婪; 補德最優先", 1, 0 },	--狂野肩鎧
			["19143"] = {"1CD，狂戰不可貪婪; 狂戰最優先", 1, 0 },	--烈焰守衛護手
			["19137"] = {"3CD，狂戰不可貪婪; 狂戰最優先", 1, 1 },	--衝擊腰帶
			["17103"] = {"3CD，法師術士不可貪婪; 法師=術士", 1, 0 },	--碧空之歌
			["18832"] = {"3CD，獵人盜賊狂戰不可貪婪; 獵人>劍賊=狂戰>匕賊=防戰", 1, 1 },	--殘忍利刃
			["18805"] = {"3CD，盜賊獵人不可貪婪; 匕賊>獵人>劍賊>狂戰", 1, 1 },	--熔火犬牙
			["18816"] = {"3CD，盜賊不可貪婪; 匕賊>劍賊", 1, 1 },	--毀滅之刃
			["17076"] = {"3CD，狂戰不可貪婪; 狂戰>防戰", 1, 1 },	--削骨之刃
			["17069"] = {"3CD，盜賊狂戰不可貪婪; 盜賊=狂戰>防戰", 1, 1 },	--速射強弓
			["17072"] = {"1CD，盜賊狂戰不可貪婪; 盜賊=狂戰>防戰", 1, 0 },	--爆擊獵槍
			["18422"] = {"1CD，只有補師可以貪婪; 防戰最優先", 1, 0 },	--奧妮克希亞的頭顱
			["17064"] = {"3CD，全補師不可貪婪; 全補師平權", 1, 0 },		--龍鱗碎片
			["17068"] = {"3CD，狂戰不可貪婪; 狂戰>防戰", 1, 0 },	--死亡召喚者
			["17075"] = {"3CD，狂戰盜賊不可貪婪; 狂戰=劍賊>匕賊=防戰", 1, 0 },	--放血者維斯卡格
---------------BWL------------------
			["19371"] = {"1CD，補師不可貪婪; 補薩>牧師=補德>法師=術士", 1, 0 },	--龍魂墜飾
			["19377"] = {"3CD，盜賊獵人不可貪婪,要被強X; 盜賊=獵人>補德=防戰", 1, 0 },	--普瑞斯托的陰謀飾物
			["19398"] = {"1CD，盜賊獵人不可貪婪; 盜賊無[環霧/飛龍]要被強X; 盜賊>獵人=防戰", 1, 0 },	--火喉披風
			["19430"] = {"3CD，全補師不可貪婪,要被強X; 全補師平權", 1, 0 },	--純淨思維披風
			["19436"] = {"1CD，狂戰盜賊不可貪婪; 狂戰要被強X; 狂戰>盜賊=防戰>補德=補薩", 1, 0 },	--飛龍披風
			["19386"] = {"1CD，防戰不可貪婪,要被強X; 防戰>補德", 1, 0 },	--源質絲線披風
			["19378"] = {"3CD，法師術士不可貪婪,要被強X; 法師=術士>其他補師", 1, 0 },	--龍王披風
			["19434"] = {"1CD，術士不可貪婪,要被強X; 術士>牧師", 1, 0 },	--龍類統御之戒
			["19397"] = {"1CD，法師術士補薩不可貪婪; 補薩最優先,其他平權", 2, 0 },	--黑石之戒
			["19403"] = {"3CD，法師術士不可貪婪,要被強X; 法師=術士", 1, 0 },	--專注指環
			["19432"] = {"1CD，盜賊獵人不可貪婪; 盜賊>防戰=補德", 2, 0 },	--源力之環
			["19376"] = {"3CD，盜賊獵人不可貪婪; 盜賊>防戰=補德", 2, 0 },	--阿基迪羅斯的清算之戒
			["19382"] = {"3CD，全補師不可貪婪,要被強X; 全補師平權", 1, 0 },	--純源質指環
			["19348"] = {"1CD，補薩不可貪婪,要被強X", 1, 0 },	--紅龍防禦者
			["19349"] = {"1CD，防戰不可貪婪; 戰士要被強X; 防戰最優先", 1, 0 },	--源質壁壘"
			["19395"] = {"3CD，全補師不可貪婪,要被強X; 全補師平權", 1, 0 },	--恢復寶石
			["19406"] = {"3CD，盜賊戰士獵人不可貪婪; 盜賊狂戰獵人要被強X; 盜賊=狂戰>防戰=獵人", 1, 1 },	--龍牙飾物
			["19431"] = {"3CD，防戰不可貪婪; 戰士要被強X; 防戰最優先", 1, 0 },	--斯泰林的甲蟲殼
			["19379"] = {"3CD，法師術士不可貪婪,要被強X; 法師=術士", 1, 1 },	--奈薩里奧之淚
			["19435"] = {"1CD，牧師不可貪婪,要被強X; 牧師最優先", 1, 0 },	--精華收集者
			["19367"] = {"1CD，法師術士牧師可貪婪", 3, 0 },	--巨龍之觸
			["19368"] = {"1CD，獵人不可貪婪; 盜賊無[紫色遠程武器]要被強X; 盜賊=防戰", 2, 0 },	--龍息手持火炮
			["19350"] = {"1CD，獵人不可貪婪; 盜賊無[紫色遠程武器]要被強X; 盜賊=防戰", 2, 0 },	--擊心者
			["19361"] = {"3CD，獵人不可貪婪,要被強X; 獵人最優先", 1, 0 },	--埃瑟利蘇爾，懲戒之弩
			["19430"] = {"1CD，牧師不可貪婪,要被強X; 牧師最優先", 1, 0 },	--純淨思想長靴
			["19438"] = {"1CD，法師不可貪婪,要被強X", 1, 0 },	--林格的暴風雪長靴
			["19370"] = {"1CD，法師術士不可貪婪,要被強X; 法師=術士>牧師=補德", 1, 0 },	--黑翼襯肩
			["19369"] = {"1CD，法師術士補師可貪婪", 3, 0 },	--疾速進化手套
			["19374"] = {"1CD，法師術士不可貪婪,要被強X; 法師=術士>其他補師", 1, 0 },	--秘法精準護腕
			["19399"] = {"1CD，法師術士補師可貪婪", 3, 0 },	--黑灰長袍
			["19400"] = {"1CD，法師術士不可貪婪; 法師術士補師平權", 2, 0 },	--火喉之握
			["19407"] = {"1CD，術士不可貪婪,要被強X; 術士>牧師", 1, 0 },	--黑焰手套
			["19388"] = {"1CD，法師術士不可貪婪; 法師術士補師平權", 2, 0 },	--安潔莉絲塔之握
			["19385"] = {"1CD，牧師不可貪婪; 牧師最優先", 1, 0 },	--強能護腿
			["19391"] = {"1CD，法師術士補師可貪婪", 3, 0 },	--閃光之鞋
			["19375"] = {"3CD，法師術士不可貪婪,要被強X; 法師=術士>其他補師", 1, 1 },	--密蘇達爾，奪魂者的頭飾"
			["19439"] = {"1CD，可以貪婪", 3, 0 },	--交織暗影外衣
			["19396"] = {"1CD，可以貪婪; 盜賊>補德", 2, 0 },	--緊繃龍皮腰帶
			["19405"] = {"1CD，可以貪婪; 補德最優先", 3, 0 },	--瑪法里恩的祝福
			["19389"] = {"1CD，可以貪婪; 盜賊=補德", 2, 0 },	--緊繃龍皮護肩
			["19390"] = {"1CD，可以貪婪; 補薩=補德", 3, 0 },	--緊繃龍皮手套
			["19381"] = {"3CD，盜賊不可貪婪,要被強X; 盜賊>補德=補薩=防戰", 1, 1 },	--暗影烈焰長靴
			["19373"] = {"1CD，可以貪婪", 3, 0 },	--黑龍肩鎧
			["19401"] = {"1CD，可以貪婪", 3, 0 },	--首領鎖鏈腿甲
			["19433"] = {"1CD，可以貪婪", 3, 0 },	--灰燼護腿
			["19393"] = {"1CD，可以貪婪", 3, 0 },	--首領鎖鏈腰帶
			["19380"] = {"1CD，可以貪婪", 3, 0 },	--塞拉贊恩之鍊
			["19372"] = {"1CD，狂戰不可貪婪; 狂戰>防戰", 2, 0 },	--無盡怒氣頭盔
			["19394"] = {"1CD，狂戰不可貪婪; 狂戰>防戰", 1, 0 },	--龍爪肩鎧
			["19402"] = {"1CD，狂戰不可貪婪", 1, 0 },	--墮落十字軍腿甲
			["19392"] = {"1CD，可以貪婪; 防戰最優先", 3, 0 },	--墮落十字軍腰帶
			["19387"] = {"3CD，狂戰不可貪婪,要被強X; 狂戰>防戰", 1, 0 },	--多彩長靴
			["19362"] = {"1CD，狂戰不可貪婪,要被強X; 狂戰>防戰", 1, 0 },	--末日之刃
			["19354"] = {"1CD，狂戰不可貪婪; 狂戰>防戰=補薩", 2, 0 },	--巨龍復仇者
			["19358"] = {"1CD，狂戰不可貪婪; 狂戰>防戰=補薩=補德", 2, 0 },	--龍人之槌
			["19335"] = {"1CD，防戰不可貪婪; 防戰>盜賊", 1, 0 },	--碎脊者
			["19334"] = {"1CD，狂戰不可貪婪; 狂戰=防戰", 2, 0 },	--狂野之刃
			["19346"] = {"1CD，盜賊獵人不可貪婪; 匕賊無犬牙要被強X; 匕賊>劍賊=防戰=獵人", 1, 0 },	--龍牙之刃
			["19351"] = {"3CD，盜賊狂戰不可貪婪; 劍賊要被強X; 劍賊>匕賊=防戰", 1, 0 },	--瑪拉達斯，黑龍軍團的符文之劍
			["19365"] = {"1CD，盜賊狂戰不可貪婪; 狂戰>盜賊=防戰", 1, 0 },	--黑龍之爪
			["19353"] = {"1CD，狂戰不可貪婪; 狂戰>防戰=補薩", 2, 0 },	--龍爪巨斧
			["19355"] = {"1CD，法師術士補師可以貪婪; 法師=術士=補薩=補德>牧師", 3, 0 },	--暗影之翼
			["19357"] = {"1CD，可以貪婪; ", 3, 0 },	--悲哀使者
			["19347"] = {"3CD，法師術士補薩補德不可貪婪; 法師術士無[碧空/SSF]要被強X; 法師=術士=補薩=補德>牧師", 1, 0 },	--克洛瑪古斯之爪
			["19352"] = {"3CD，盜賊狂戰不可貪婪; 劍賊要被強X; 劍賊>匕賊=防戰", 1, 0 },	--多彩之劍
			["19360"] = {"3CD，全補師不可貪婪; 補薩補德無[狗爪]要被強X; 補薩=補德>牧師", 1, 0 },	--洛卡米爾·伊洛曼希斯
			["19363"] = {"3CD，狂戰不可貪婪,要被強X; 狂戰>防戰", 1, 0 },	--克盧梭洛克恩，混亂之刃
			["19364"] = {"3CD，狂戰獵人不可貪婪; 狂戰要被強X; 狂戰>防戰=獵人", 1, 1 },	--阿什坎迪，兄弟會之劍
			["19356"] = {"3CD，法師術士不可貪婪,要被強X; 法師=術士", 1, 1 },	--暗影烈焰法杖
			["19002"] = {"1CD，戰士盜賊法師術士不可貪婪; 防戰要被強X; 防戰>狂戰=盜賊=法師=術士", 1, 0 },	--奈法利安的頭顱
------------test--------------------
---- 防戰 狂戰 盜賊 獵人 法師術士 牧師 補德 補薩 全補師 不可貪婪 不可放棄 要被強X 必須有 > = 最優先 平權
			["0000"] = {"test", 0, 0 } --test
};

CEPGP_subroster = {
			[1]={true, "你太傲慢了", "Vela"},
			[2]={true , "娜娜亞", "希希雷夢"},
			[3]={true, "不能沒有你", "牛轉未來"},
			[4]={true, "我能射你能吗", "鍵盤文藝青年"},
			[5]={true, "棒棒糖先生", "Bazingaa"},
			[6]={true, "大牛比較懒", "夏麵羊死了"},
			[7]={true, "妖獸嘻狼", "妖獸嘻狼骨"},
			[8]={true, "邪天御", "羽飛天"},
			[9]={true, "水噹噹", "花凝雪"},
			[10]={true, "黑田如水", "楠木正成"},
			[11]={true, "日爾曼戰神", "達羅威夫人"},
			[12]={true, "Northface", "Arcteryx"},
			[13]={true, "鬆搗菜瓜布", "兵騎兩百步"},
			[14]={true, "我徒弟珍娜", "小神童"},
			[15]={true, "Epicrit", "Epictotem"},
			[16]={true, "貓魅", "花藝助理貓魅"},
			[17]={true, "三殿", "昆林樹"},
			[18]={true, "我是一隻牛", "小背刺"},
			[19]={true, "活著就是死", "活著德傢伙"},
			[20]={true, "衝鋒釋放", "閃現釋放靈魂"},
			[21]={true, "黑田如水", "楠木正季"}
}; --plus: [i]={true, "公會內計分角色", "替身"}(true/false表示關閉,替身可以是非公會的，請至少保留1個數組)(名字區分大小寫)
CEPGP_subacc_flag = false; -- plus 替身分數累加功能總開關。false：若計分角色和替身都在團隊裏，CEPGP_AddRaidEP加EP只會加1次到計分角色上，true：表示會多次累加EP到計分角色上
CEPGP_subacc_roster = {["你太傲慢了"]={false, 0 },["八月悠"]={false, 0 },["二月悠"]={false, 0 },["Lessness"]={false, 0 },["三月悠"]={false, 0 }}; -- plus 替身EP允許累加名單，"0"不能修改，請至少保留1個數組，true/false 表示開關，只在CEPGP_AddRaidEP內有效
CEPGP_InitialGP_flag = false; --plus 新會員初始GP功能總開關。初始GP只在團員Call裝備時替代其真實的GP，不影響真實GP的記錄
CEPGP_InitialGP_roster = {["久久牧"]={false, 100 },["就只知道吃"]={false, 100 },["葉法奈"]={false, 100 },["鬆搗菜瓜布"]={false, 100 },["部落之首"]={false, 100 },["聯盟家屬答禮"]={false, 100 }}; -- plus 新會員初始GP。遇到分身時，要用"公會內計分角色"，用"替身"無效


