
MulDistID = "17966"; --plus 奧妮克希亞皮袋 17966 統計此人拾取次數

CEPGP_T2Mes = "L1，T2不可貪婪(狂暴戰/野德除外),要被強X";
CEPGP_AllGreedMes = "可以貪婪";
CEPGP_CallItemMes = "要[需求]此裝備，請密我打\"1\"，要[貪婪]密我\"2\"，要[放棄]密我\"3\"。";

---["物品ID"] = {"物品說明", 0 }---(0=不增加通告，1=另外增加通告：此裝備歷史分配數量)
CEPGP_ItemPR = {
---------------MC------------------
			["18703"] = {"L1，獵人不可貪婪", 0 },	--遠古石葉
			["18646"] = {"L1，牧師不可貪婪; 牧師必須有", 0 },	--神聖之眼
			["18814"] = {"L3，法師術士不可貪婪; 法師=術士", 1 },	--火焰之王的項圈
			["17065"] = {"L1，防戰野德不可貪婪; 防戰=野德>狂戰", 0 },	--穩固之力勳章
			["17102"] = {"L3，獵人盜賊不可貪婪; 獵人>盜賊", 0 },	--環霧披風
			["19147"] = {"L3，法師術士不可貪婪; 法師=術士", 1 },	--法術能量之戒
			["19140"] = {"L3，全補師不可貪婪; 全補師平權", 0 },		--灼燒指環
			["18879"] = {"L1，防戰野德不可貪婪; 防戰=野德>狂戰", 0 },	--沉重的黑鐵戒指
			["18821"] = {"L3，獵人盜賊狂戰不可貪婪; 獵人>盜賊=狂戰", 1 },	--迅擊戒指
			["17063"] = {"L3，盜賊戰士獵人野德不可貪婪; 盜賊=狂戰>防戰>獵人>野德", 1 },	--埃古雷亞指環
			["18820"] = {"L3，法師術士不可貪婪; 法師=術士", 1 },	--短暫能量護符
			["19145"] = {"L1，法師術士不可貪婪; 法師=術士", 0 },	--波動長袍
			["19136"] = {"L1，法師術士不可貪婪; 法師=術士", 0 },	--燃魔腰帶
			["19146"] = {"L1，狂戰野德不可貪婪; 狂戰>野德", 0 },	--穩固護腕
			["18810"] = {"L1，補德不可貪婪; 補德最優先", 0 },	--狂野肩鎧
			["19143"] = {"L1，狂戰不可貪婪; 狂戰最優先", 0 },	--烈焰守衛護手
			["19137"] = {"L3，狂戰不可貪婪; 狂戰要被強X; 狂戰最優先", 1 },	--衝擊腰帶
			["17103"] = {"L3，法師術士不可貪婪; 法師=術士", 0 },	--碧空之歌
			["18832"] = {"L3，獵人劍賊狂戰不可貪婪; 獵人=狂戰=劍賊>匕賊", 1 },	--殘忍利刃
			["18805"] = {"L3，匕賊獵人狂戰不可貪婪; 匕賊>獵人=狂戰=劍賊", 1 },	--熔火犬牙
			["18816"] = {"L3，匕賊不可貪婪; 匕賊要被強X; 匕賊>劍賊", 1 },	--毀滅之刃
			["17076"] = {"L3，狂戰不可貪婪; 狂戰>防戰", 1 },	--削骨之刃
			["17069"] = {"L3，盜賊狂戰不可貪婪; 盜賊=狂戰>防戰", 1 },	--速射強弓
			["17072"] = {"L1，盜賊狂戰不可貪婪; 盜賊=狂戰>防戰", 0 },	--爆擊獵槍
			["18563"] = {"", 0 }, 	-- [風劍左]
			["18564"] = {"", 0 }, 	-- [風劍右]
			["17204"] = {"", 0 }, 	-- [薩弗拉斯之眼]
			["19017"] = {"", 0 }, 	-- [火焰之王的精華]
---------------MC圖紙------------------
			["18264"] = {"", 0 }, 	-- [設計圖：元素磨刀石]
			["18292"] = {"", 0 }, 	-- [結構圖：火核狙擊步槍]
			["18291"] = {"", 0 }, 	-- [結構圖：力回饋盾牌]
			["18290"] = {"", 0 }, 	-- [結構圖：比茲尼克247x128精確瞄準鏡]
			["18259"] = {"", 0 }, 	-- [公式：附魔武器 - 法術能量]
			["18260"] = {"", 0 }, 	-- [公式：附魔武器 - 治療能量]
			["18252"] = {"", 0 }, 	-- [圖樣：熔火護甲片]
---------------黑龍-----------------------
			["17966"] = {"沒拿過的請Roll點。Roll點最高的，請[私聊]我打\"1\"。", 0 },	--奧妮克希亞皮袋
			["18422"] = {"L1，只有補師可以貪婪; 防戰最優先", 0 },	--奧妮克希亞的頭顱
			["17064"] = {"L3，全補師不可貪婪; 全補師平權", 0 },		--龍鱗碎片
			["17068"] = {"L3，狂戰不可貪婪; 狂戰>防戰", 0 },	--死亡召喚者
			["17075"] = {"L3，狂戰劍賊不可貪婪; 狂戰=劍賊>匕賊=防戰", 0 },	--放血者維斯卡格
---------------BWL------------------
			["19371"] = {"L1，補師不可貪婪; 補薩>牧師=補德>法師=術士", 0 },	--龍魂墜飾
			["19377"] = {"L3，盜賊獵人野德不可貪婪; 盜賊獵人要被強X; 盜賊=獵人>野德=防戰", 0 },	--普瑞斯托的陰謀飾物
			["19398"] = {"L1，盜賊獵人不可貪婪; 盜賊無[環霧/飛龍]要被強X; 盜賊>獵人=防戰", 0 },	--火喉披風
			["19430"] = {"L3，全補師不可貪婪,要被強X; 全補師平權", 0 },	--純淨思維披風
			["19436"] = {"L1，狂戰盜賊野德不可貪婪; 狂戰要被強X; 狂戰>盜賊=防戰=野德", 0 },	--飛龍披風
			["19386"] = {"L1，防戰野德不可貪婪; 防戰要被強X; 防戰=野德", 0 },	--源質絲線披風
			["19378"] = {"L3，法師術士不可貪婪; 法師=術士>其他補師", 0 },	--龍王披風
			["19434"] = {"L1，術士不可貪婪,要被強X; 術士>牧師", 0 },	--龍類統御之戒
			["19397"] = {"L1，法師術士補薩不可貪婪; 補薩最優先,其他平權", 0 },	--黑石之戒
			["19403"] = {"L3，法師術士不可貪婪,要被強X; 法師=術士", 0 },	--專注指環
			["19432"] = {"L1，獵人野德不可貪婪; 盜賊=野德>防戰", 0 },	--源力之環
			["19376"] = {"L3，盜賊獵人野德不可貪婪; 盜賊=野德>防戰", 0 },	--阿基迪羅斯的清算之戒
			["19382"] = {"L3，全補師不可貪婪,要被強X; 全補師平權", 0 },	--純源質指環
			["19348"] = {"L1，補薩不可貪婪,無[生命花環]要被強X", 0 },	--紅龍防禦者
			["19349"] = {"L1，防戰不可貪婪; 戰士要被強X; 防戰最優先", 0 },	--源質壁壘"
			["19395"] = {"L3，全補師不可貪婪,要被強X; 全補師平權", 0 },	--恢復寶石
			["19406"] = {"L3，盜賊戰士獵人野德不可貪婪; 盜賊狂戰獵人要被強X; 盜賊=狂戰>防戰=獵人>野德", 1 },	--龍牙飾物
			["19431"] = {"L3，防戰不可貪婪; 戰士要被強X; 防戰最優先", 0 },	--斯泰林的甲蟲殼
			["19379"] = {"L3，法師術士不可貪婪,要被強X; 法師=術士", 1 },	--奈薩里奧之淚
			["19435"] = {"L1，牧師不可貪婪,要被強X; 牧師最優先", 0 },	--精華收集者
			["19367"] = {"L1，法師術士牧師可貪婪", 0 },	--巨龍之觸
			["19368"] = {"L1，獵人不可貪婪; 盜賊無[紫色遠程武器]要被強X; 盜賊=防戰", 0 },	--龍息手持火炮
			["19350"] = {"L1，獵人不可貪婪; 盜賊無[紫色遠程武器]要被強X; 盜賊=防戰", 0 },	--擊心者
			["19361"] = {"L3，獵人不可貪婪,要被強X; 獵人最優先", 0 },	--埃瑟利蘇爾，懲戒之弩
			["19430"] = {"L1，牧師不可貪婪,要被強X; 牧師最優先", 0 },	--純淨思想長靴
			["19438"] = {"L1，法師不可貪婪,要被強X", 0 },	--林格的暴風雪長靴
			["19370"] = {"L1，法師術士不可貪婪,要被強X; 法師=術士>牧師=補德", 0 },	--黑翼襯肩
			["19369"] = {"L1，法師術士補師可貪婪", 0 },	--疾速進化手套
			["19374"] = {"L1，法師術士不可貪婪,要被強X; 法師=術士>其他補師", 0 },	--秘法精準護腕
			["19399"] = {"L1，法師術士補師可貪婪", 0 },	--黑灰長袍
			["19400"] = {"L1，法師術士不可貪婪; 法師術士補師平權", 0 },	--火喉之握
			["19407"] = {"L1，術士不可貪婪,要被強X; 術士>牧師", 0 },	--黑焰手套
			["19388"] = {"L1，法師術士不可貪婪; 法師術士補師平權", 0 },	--安潔莉絲塔之握
			["19385"] = {"L1，牧師不可貪婪; 牧師最優先", 0 },	--強能護腿
			["19391"] = {"L1，法師術士補師可貪婪", 0 },	--閃光之鞋
			["19375"] = {"L3，法師術士不可貪婪,要被強X; 法師=術士>其他補師", 1 },	--密蘇達爾，奪魂者的頭飾"
			["19439"] = {"L1，可以貪婪", 0 },	--交織暗影外衣
			["19396"] = {"L1，野德不可貪婪; 野德>盜賊", 0 },	--緊繃龍皮腰帶
			["19405"] = {"L1，野德不可貪婪; 野德最優先", 0 },	--瑪法里恩的祝福
			["19389"] = {"L1，野德不可貪婪; 野德>盜賊", 0 },	--緊繃龍皮護肩
			["19390"] = {"L1，可以貪婪; 補薩=補德", 0 },	--緊繃龍皮手套
			["19381"] = {"L3，盜賊野德不可貪婪; 盜賊要被強X; 盜賊=野德>補薩=補德=防戰", 1 },	--暗影烈焰長靴
			["19373"] = {"L1，可以貪婪", 0 },	--黑龍肩鎧
			["19401"] = {"L1，可以貪婪", 0 },	--首領鎖鏈腿甲
			["19433"] = {"L1，可以貪婪", 0 },	--灰燼護腿
			["19393"] = {"L1，可以貪婪", 0 },	--首領鎖鏈腰帶
			["19380"] = {"L1，可以貪婪", 0 },	--塞拉贊恩之鍊
			["19372"] = {"L1，狂戰不可貪婪; 狂戰>防戰", 0 },	--無盡怒氣頭盔
			["19394"] = {"L1，狂戰不可貪婪; 狂戰>防戰", 0 },	--龍爪肩鎧
			["19402"] = {"L1，狂戰不可貪婪", 0 },	--墮落十字軍腿甲
			["19392"] = {"L1，可以貪婪; 防戰最優先", 0 },	--墮落十字軍腰帶
			["19387"] = {"L3，狂戰不可貪婪,要被強X; 狂戰>防戰", 0 },	--多彩長靴
			["19362"] = {"L1，狂戰不可貪婪,要被強X; 狂戰>防戰", 0 },	--末日之刃
			["19354"] = {"L1，狂戰不可貪婪; 狂戰>防戰=補薩", 0 },	--巨龍復仇者
			["19358"] = {"L1，狂戰野德不可貪婪; 狂戰=野德>防戰=補薩=補德", 0 },	--龍人之槌
			["19335"] = {"L1，防戰不可貪婪; 防戰>盜賊", 0 },	--碎脊者
			["19334"] = {"L1，狂戰不可貪婪; 狂戰=防戰", 0 },	--狂野之刃
			["19346"] = {"L1，匕賊獵人不可貪婪; 匕賊無[狗牙/無面]要被強X; 匕賊>劍賊=防戰=獵人", 0 },	--龍牙之刃
			["19351"] = {"L3，劍賊狂戰不可貪婪; 劍賊要被強X; 劍賊>匕賊=防戰", 0 },	--瑪拉達斯，黑龍軍團的符文之劍
			["19365"] = {"L1，狂戰不可貪婪; 狂戰>盜賊=防戰", 0 },	--黑龍之爪
			["19353"] = {"L1，狂戰不可貪婪; 狂戰>防戰=補薩", 0 },	--龍爪巨斧
			["19355"] = {"L1，可以貪婪(法術牧薩德); 法師=術士=補薩=補德>牧師=野德", 0 },	--暗影之翼
			["19357"] = {"L1，可以貪婪", 0 },	--悲哀使者
			["19347"] = {"L3，法師術士補薩補德不可貪婪; 法師術士無[碧空/SSF]要被強X; 法師=術士=補薩=補德>牧師=野德", 0 },	--克洛瑪古斯之爪
			["19352"] = {"L3，劍賊狂戰不可貪婪; 劍賊要被強X; 劍賊>匕賊=防戰", 0 },	--多彩之劍
			["19360"] = {"L3，全補師不可貪婪; 補薩補德無[狗爪]要被強X; 補薩=補德>牧師>野德", 0 },	--洛卡米爾·伊洛曼希斯
			["19363"] = {"L3，狂戰不可貪婪,要被強X; 狂戰>防戰", 0 },	--克盧梭洛克恩，混亂之刃
			["19364"] = {"L3，狂戰獵人不可貪婪; 狂戰要被強X; 狂戰>防戰=獵人", 1 },	--阿什坎迪，兄弟會之劍
			["19356"] = {"L3，法師術士不可貪婪,要被強X; 法師=術士", 1 },	--暗影烈焰法杖
			["19002"] = {"L1，戰士野德盜賊法師術士不可貪婪; 防戰要被強X; 防戰=野德>狂戰=盜賊=法師=術士>全補師;獵人NA", 0 },	--奈法利安的頭顱
---------------BWL職業飾品------------------
			["19341"] = {"", 0 }, 	-- [生命寶石]
			["19342"] = {"", 0 }, 	-- [毒性圖騰]
			["19336"] = {"", 0 }, 	-- [秘法能量寶石]
			["19339"] = {"", 0 }, 	-- [思維加速寶石]
			["19337"] = {"", 0 }, 	-- [黑龍之書]
			["19345"] = {"", 0 }, 	-- [庇護者]
			["19344"] = {"", 0 }, 	-- [自然之盟水晶]
			["19343"] = {"", 0 }, 	-- [盲目光芒卷軸]
			["19340"] = {"", 0 }, 	-- [變形符文]
---------------BWL任務物品----------------------
			["20383"] = {"", 0 }, 	-- [勒西雷爾的頭顱]
------------test--------------------
---- 防戰 狂戰 盜賊 獵人 法師 術士 牧師 補德 野德 補薩 全補師 不可貪婪 不可放棄 要被強X 必須有 > = 最優先 平權
			["0000"] = {"test", 0 } -- test
};

CEPGP_subroster_bak = {
			[1]={true, "你太傲慢了", "Vela"},
			[2]={true , "娜娜亞", "希希雷夢"},
			[3]={true, "不能沒有你", "牛轉未來"},
			[4]={true, "我能射你能吗", "鍵盤文藝青年"},
			[5]={true, "棒棒糖先生", "Bazingaa"},
			[6]={true, "大牛比較懒", "夏麵羊死了"},
			[7]={true, "妖獸嘻狼", "妖獸嘻狼骨"},
			[8]={true, "邪天御", "羽飛天"},
			[9]={true, "水噹噹", "花凝雪"},
			[10]={true, "黑田如水", "楠木正成"},
			[11]={true, "日爾曼戰神", "達羅威夫人"},
			[12]={true, "Northface", "Arcteryx"},
			[13]={true, "鬆搗菜瓜布", "兵騎兩百步"},
			[14]={true, "我徒弟珍娜", "小神童"},
			[15]={true, "Epicrit", "Epictotem"},
			[16]={true, "貓魅", "花藝助理貓魅"},
			[17]={true, "三殿", "昆林樹"},
			[18]={true, "我是一隻牛", "小背刺"},
			[19]={true, "活著就是死", "活著德傢伙"},
			[20]={true, "衝鋒釋放", "閃現釋放靈魂"},
			[21]={true, "黑田如水", "楠木正季"},
			[22]={true, "棒棒糖先生", "海綿體堡包"},
			[23]={true, "喵喵步", "梅猶血"},
			[24]={true, "野蠻阿寶", "全省手工茶"},
			[25]={true, "野蠻阿寶", "坦寶"},
			[26]={true, "來啦老弟", "克爾囌加德"},
			[27]={true, "一刀斧", "一刀狼"},
			[28]={true, "不能沒有你", "尼葛"},
			[29]={true, "七星計分用", "七星一包"},
			[30]={true, "火鳳燎原", "Allinwin"},
			[31]={true, "稻葉浩志", "高希茵娜"},
			[32]={true, "低能兒的天空", "低能兒麵包讚"},
			[33]={true, "來啦老弟", "Piapiapia"},
			[34]={true, "七星計分用", "棒會休林刀"},
			[35]={true, "我是一隻牛", "小火球"},
			[36]={true, "薑姆鴨", "卡拉姆酒"},
			[37]={true, "一刀斧", "一刀斬"},
			[38]={true, "妖獸嘻狼", "妖獸歐嬤嬤"},
			[39]={true, "日爾曼戰神", "項塔蘭"},
			[40]={true, "大號aa", "小號bb"},
			[41]={true, "大號aa", "小號bb"},
			[42]={true, "大號aa", "小號bb"},
			[43]={true, "大號aa", "小號bb"},
			[44]={true, "大號aa", "小號bb"},
			[45]={true, "大號aa", "小號bb"},
			[46]={true, "大號aa", "小號bb"},
			[47]={true, "大號aa", "小號bb"},
			[48]={true, "大號aa", "小號bb"},
			[49]={true, "大號aa", "小號bb"},
			[50]={true, "大號aa", "小號bb"},
			[51]={true, "大號aa", "小號bb"},
			[52]={true, "大號aa", "小號bb"},
			[53]={true, "大號aa", "小號bb"},
			[54]={true, "大號aa", "小號bb"},
			[55]={true, "testxxxy", "testxxxx"}
}; -- [i]={true, "公會內計分角色", "替身"}(true/false表示關閉,替身可以是非公會的，請至少保留1個數組)(名字區分大小寫)

CEPGP_subacc_flag = false; -- 替身分數累加功能總開關。false：若計分角色和替身都在團隊裏，CEPGP_AddRaidEP加EP只會加1次到計分角色上，true：表示會多次累加EP到計分角色上
CEPGP_subacc_roster = {["你太傲慢了"]={false, 0 },["八月悠"]={false, 0 },["二月悠"]={false, 0 },["Lessness"]={false, 0 },["三月悠"]={false, 0 }}; -- 替身EP允許累加名單，"0"不能修改，請至少保留1個數組，true/false 表示開關，只在CEPGP_AddRaidEP內有效

CEPGP_InitialGP_flag = false; -- 新會員初始GP功能總開關。初始GP只在團員Call裝備時替代其真實的GP，不影響真實GP的記錄
CEPGP_InitialGP_roster = {["久久牧"]={false, 100 },["就只知道吃"]={false, 100 },["葉法奈"]={false, 100 },["鬆搗菜瓜布"]={false, 100 },["部落之首"]={false, 100 },["聯盟家屬答禮"]={false, 100 }}; -- 新會員初始GP。遇到分身時，要用"公會內計分角色"，用"替身"無效

function Re_Block_Words(Msg)
	local Msg_C = Msg;
	if string.find(Msg_C, "卍") then 
		Msg_C = string.gsub(Msg_C, "卍", "#");
	end
	if string.find(Msg_C, "卐") then 
		Msg_C = string.gsub(Msg_C, "卐", "#");
	end
	return Msg_C;
end

function CEPGP_subrosterUpdate(event)
	if CEPGP_ignoreUpdates or not IsInGuild() then return; end
	if event == "GUILD_ROSTER_UPDATE" then
		local numGuild = GetNumGuildMembers();
		CEPGP_subroster = {};
		local x = 1;
		for i = 1, numGuild do
			local name, _, _, _, _, _, publicNote = GetGuildRosterInfo(i);
			if string.find(name, "-") then
				name = string.sub(name, 0, string.find(name, "-")-1);
			end
			if name then
				local Note = publicNote;
				while (string.find(Note, "%[.-%]")) do
					local starti, endj = string.find(Note, "%[.-%]");
					local subname = string.sub(Note, starti+1, endj-1);
					Note = string.sub(Note, endj+1);
					if subname ~= "" then
						CEPGP_subroster[x] = {true, name, subname};
						x = x + 1;
					end
				end
			end
		end
	end
end